[

    {
        "id":"f61e0b63-61b2-4fff-957c-39e1adb7e766",
  "image_Url": "https://geprc.com/wp-content/uploads/2022/12/MARK5-DC-3-800x800.jpg",
  
   "name": "GEPRC MARK5 DC HD O3 FPV",
  
   "description" : "The HD VTX ushered in a new upgrade, and the brand new VTX of DJI O3 air unit pushed the digital      system to a new level.The GEPRC team is also upgrading and optimizing the overall performance on the basis of MARK5. At the same time, it will be equipped with DJI O3 air unit to design the new MARK5 O3 version, the versions are MK5D and MK5X respectively."
  ,
  "price": "569.99"
  
  
    },
  
  
    {
        
        "id":"6476ccb2-23c9-4615-bc7d-d55ea061ec1b",
  "image_Url": "https://geprc.com/wp-content/uploads/2022/11/GEPRC-Cinebot30-HD-O3-FPV-Drone-4.jpg",
  
     "name": "GEPRC Cinebot30 HD O3 FPV Drone",
  
     "description" : "O3 Air Unit is currently the most advanced FPV system on the market. It can transmit 1080P 60fps real-time images, and can also record up to 4K 60fps images with anti-shake effect at the same time. This drone is be equipped with a powerful 1804 motor with optimized motor magnetic circuit and surging torque, which can easily cope with ultra-low altitude shooting",
  
     "price": "554.99"
  
  
    },
  
   
   
    {
        "id":"f2bf4020-6e56-4123-be18-3773e141b7da",
        "image_Url": "https://cdn.shopify.com/s/files/1/1349/4827/products/Flywoo_Explorer_LR_4_HD_DJI_O3_Sub250_Micro_Long_Range_Drone_0.webp?v=1672792281",
  
     "name": "Explorer LR 4 HD DJI SUB250",
     "description" : "The DJI O3 Air unit is an exceptional digital module that perfectly complements the Explorer LR 4. With its impressive 4K/60fps recording capabilities and long-range capabilities of up to 10KM (FCC), this unit is sure to impress even the most discerning aerial photographers and videographers.",
     "price": "489.99"
  
  
    },
    {
       
        "id":"33add759-9b86-47db-95b7-1bfd6a38c223",
        "image_Url": "https://cdn.shopify.com/s/files/1/1349/4827/products/iFlight_Chimera_7_Pro_V2_6S_HD_DJI_O3_Air_Unit_2.jpg?v=1669144360",
  
     "name": "Chimera7 Pro V2 6S HD",
  
     "description": "The KING of Long Range FPV! Another breakthrough in FPV visuals from DJI with our upgraded frame and electronics. A super-efficient iFlight 7.5inch Long-Range bird that can go where you couldn't go before and can carry bigger batteries to get the flight time to surf the swiss alps if you want.A super stiff frame for minimum resonance and XING2 2809 motors for maximum 7.5inch prop control. Fly big batteries top-mounted, or even bigger batteries bottom-mounted, 6cells recommended or 5cells for slow cruising. But whatever style you fly, a Lipo or Lion pack will just do the job. Recommended 5S 3.000mAh above (slow cruising) or our new 6S 3300mAh battery.",
  
     "price": 739.99
  
  
    },
  
    {
        "id":"dc01fb37-a0e1-41c0-a250-dd519bf9b134",
        "image_Url": "https://cdn.shopify.com/s/files/1/1285/4651/products/download-2021-05-17T130443.973_1800x1800.jpg?v=1621271945",
     "name": "Cetus X FPV Kit",
     "description" : "Whether skillful pilots or new beginners, Cetus X FPV Kit, as the advanced 2S power whoop bundle, is a completely primary choice to reach a higher stage. From its unparalleled control to its exciting flying that has you immersed your experience through every FPV flight, there is simply nothing like Cetus X FPV Kit. With the combination of Cetus X Brushless Quadcopter, LiteRadio 3 Radio Transmitter, and VR03 FPV Goggles, get ready for the next level.",
     "price": "309.99"
  
  
    }
  
  ]